In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\sujal\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\sujal\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\sujal\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\sujal\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: six>=1.5 in c:\users\sujal\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("https://raw.githubusercontent.com/selva86/datasets/refs/heads/master/BostonHousing.csv")

In [4]:
# df.to_csv("D:\sujal class\files\Bosten_data.csv")

In [5]:
d={"key":"value","age":"21"}

In [6]:
d['age']

'21'

In [7]:
df

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,11.9

In [8]:
df['crim']

0      0.00632
1      0.02731
2      0.02729
3      0.03237
4      0.06905
        ...
501    0.06263
502    0.04527
503    0.06076
504    0.10959
505    0.04741
Name: crim, Length: 506, dtype: float64

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
type(df['age'])

pandas.core.series.Series

In [11]:
df['age'].dtype

dtype('float64')

In [12]:
df['crim'].dtype

dtype('float64')

In [13]:
df=pd.read_excel(r"D:\sujal class\files\Titanic.xlsx")

In [14]:
df[['Age','Name']]

      Age                                               Name
0    22.0                            Braund, Mr. Owen Harris
1    38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    26.0                             Heikkinen, Miss. Laina
3    35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4    35.0                           Allen, Mr. William Henry
..    ...                                                ...
886  27.0                              Montvila, Rev. Juozas
887  19.0                       Graham, Miss. Margaret Edith
888   NaN           Johnston, Miss. Catherine Helen "Carrie"
889  26.0                              Behr, Mr. Karl Howell
890  32.0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [15]:
type(df[['Age','Name']])

pandas.core.frame.DataFrame

In [16]:
df.describe()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
count,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,2.308642,29.699118,0.523008,0.381594,32.204208,0.383838
std,257.353842,0.836071,14.526497,1.102743,0.806057,49.693429,0.486592
min,1.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,446.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000
75%,668.500000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,891.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [17]:
# To check the object value in the table.

df.dtypes=="object"

PassengerId    False
Name            True
Pclass         False
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
Survived       False
dtype: bool

In [18]:
# By this it only give object values.

df.dtypes[df.dtypes=="object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [19]:
# for proper way

df.dtypes[df.dtypes=="object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [20]:
#  it give only that column in which object is present

df[df.dtypes[df.dtypes=="object"].index]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [21]:
df[df.dtypes[df.dtypes=="object"].index].describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [22]:
df[df.dtypes[df.dtypes=="float"].index].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [23]:
df1=pd.read_csv(r"D:\sujal class\files\car_data.csv")

In [24]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [25]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [26]:
# Slicing operation
# row wise
df1[1:7]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
5,vitara brezza,2018,9.25,9.83,2071,Diesel,Dealer,Manual,0
6,ciaz,2015,6.75,8.12,18796,Petrol,Dealer,Manual,0

In [27]:
df1[1:6:2]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
5,vitara brezza,2018,9.25,9.83,2071,Diesel,Dealer,Manual,0

In [28]:
# Column wise

df1['Car_Name'][1:7]

1              sx4
2             ciaz
3          wagon r
4            swift
5    vitara brezza
6             ciaz
Name: Car_Name, dtype: object

In [29]:
df1=pd.read_csv(r"D:\sujal class\files\car_data.csv")

In [30]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [31]:
# Adding new colomn in the table
#  If colunm name already exist then it upaate the value.

df1["Current_Year"]=2025

In [32]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025
...,...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0,2025
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0,2025
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0,2025
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0,2025
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,2025

In [33]:
df1['Difference']=df1['Current_Year']-df1['Year']

In [34]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Difference
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11
...,...,...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0,2025,9
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0,2025,10
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0,2025,16
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0,2025,8
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,2025,9

In [35]:
#  Is null

df.isnull().sum()

PassengerId      0
Name             0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [36]:
#  To find the maximum driven km in the table.

df1[df1['Kms_Driven'] == max(df1['Kms_Driven'])]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Difference
196,Activa 3g,2008,0.17,0.52,500000,Petrol,Individual,Automatic,0,2025,17

In [37]:
# For a specific column

df1[df1['Kms_Driven'] == max(df1['Kms_Driven'])]['Year']

196    2008
Name: Year, dtype: int64

In [38]:
#  To check the cars are from years 2014.

df1[df1['Year']==2014]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Difference
0,ritz,2014,3.35,5.590,27000,Petrol,Dealer,Manual,0,2025,11
4,swift,2014,4.60,6.870,42450,Diesel,Dealer,Manual,0,2025,11
23,alto k10,2014,2.50,3.460,45280,Petrol,Dealer,Manual,0,2025,11
32,swift,2014,4.95,7.490,39000,Diesel,Dealer,Manual,0,2025,11
33,ertiga,2014,6.00,9.950,45000,Diesel,Dealer,Manual,0,2025,11
34,dzire,2014,5.50,8.060,45000,Diesel,Dealer,Manual,0,2025,11
41,alto k10,2014,2.55,3.980,46706,Petrol,Dealer,Manual,0,2025,11
43,dzire,2014,5.50,8.060,45780,Diesel,Dealer,Manual,0,2025,11
45,ciaz,2014,7.50,12.040,15000,Petrol,Dealer,Automatic,0,2025,11
58,etios g,2014,4.10,6.800,39485,Petrol,Dealer,Manual,1,2025,11
59,fortuner,2014,19.99,35.960,41000,Diesel,Dealer,Automatic,0,2025,11
62,fortuner,2014,18.75,35.960,78000,Diesel,Dealer,Automatic,0,2025,11
65,etios liva,2014,4.75,6.950,45000,Diesel,Dealer,Manual,0,2025,11
70,etios liva,2014,3.95,6.760,71000,Diesel,Dealer,Manual,0,2025,11
74,etios cross,2014,4.90,8.930,83000,Diesel,Dealer,Manual,0,2025,11
89,etios g,2014,4.75,6.760,40000,Petrol,Dealer,Manual,0,2025,11
91,innova,2014,11.25,16.090,58242,Diesel,Dealer,Manual,0,2025,11
106,Hyosung GT250R,2014,1.35,3.450,16500,Petrol,Individual,Manual,1,2025,11
112,KTM 390 Duke,2014,1.15,2.400,7000,Petrol,Individual,Manual,0,2025,11
136,Honda CBR 150,2014,0.65,1.200,23500,Petrol,Individual,Manual,0,2025,11
144,Bajaj Pulsar NS 200,2014,0.60,0.990,25000,Petrol,Individual,Manual,0,2025,11
146,Hero Extreme,2014,0.55,0.787,15000,Petrol,Individual,Manual,0,2025,11
154,Yamaha Fazer,2014,0.50,0.880,8000,Petrol,Individual,Manual,0,2025,11
161,TVS Apache RTR 180,2014,0.45,0.826,23000,Petrol,Individual,Manual,0,2025,11
167,TVS Apache RTR 160,2014,0.42,0.810,42000,Petrol,Individual,Manual,0,2025,11
172,Bajaj Pulsar 135 LS,2014,0.40,0.640,13700,Petrol,Individual,Manual,0,2025,11
178,TVS Jupyter,2014,0.35,0.520,19000,Petrol,Individual,Automatic,0,2025,11
218,verna,2014,6.45,9.400,45078,Petrol,Dealer,Manual,0,2025,11
222,i20,2014,6.00,7.600,77632,Diesel,Dealer,Manual,0,2025,11
242,xcent,2014,4.40,7.130,34000,Petrol,Dealer,Manual,0,2025,11
253,city,2014,7.20,9.900,48000,Diesel,Dealer,Manual,0,2025,11
259,amaze,2014,3.90,7.000,36054,Petrol,Dealer,Manual,0,2025,11
266,amaze,2014,3.65,7.000,35000,Petrol,Dealer,Manual,0,2025,11
274,brio,2014,5.30,6.800,16500,Petrol,Dealer,Manual,0,2025,11
279,city,2014,6.25,13.600,40126,Petrol,Dealer,Manual,0,2025,11
282,city,2014,8.25,14.000,63000,Diesel,Dealer,Manual,0,2025,11
290,amaze,2014,4.50,6.400,19000,Petrol,Dealer,Manual,0,2025,11
294,amaze,2014,3.75,6.800,33019,Petrol,Dealer,Manual,0,2025,11

In [39]:
df1[df1['Year']==2014].shape

(38, 11)

In [40]:
len(df1[df1['Year']==2014])

38

In [41]:
#  car is greater than 2014 and kms driven is less than 7000 if both condition will be true

df1[(df1['Year']>2014) & (df1['Kms_Driven']<7000)]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Difference
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8
5,vitara brezza,2018,9.25,9.83,2071,Diesel,Dealer,Manual,0,2025,7
10,alto 800,2017,2.85,3.60,2135,Petrol,Dealer,Manual,0,2025,8
21,ignis,2017,4.90,5.71,2400,Petrol,Dealer,Manual,0,2025,8
64,fortuner,2017,33.00,36.23,6000,Diesel,Dealer,Automatic,0,2025,8
100,Royal Enfield Thunder 500,2016,1.75,1.90,3000,Petrol,Individual,Manual,0,2025,9
101,UM Renegade Mojave,2017,1.70,1.82,1400,Petrol,Individual,Manual,0,2025,8
102,KTM RC200,2017,1.65,1.78,4000,Petrol,Individual,Manual,0,2025,8
103,Bajaj Dominar 400,2017,1.45,1.60,1200,Petrol,Individual,Manual,0,2025,8
104,Royal Enfield Classic 350,2017,1.35,1.47,4100,Petrol,Individual,Manual,0,2025,8
110,KTM RC200,2016,1.20,1.78,6000,Petrol,Individual,Manual,0,2025,9
120,Bajaj Pulsar RS200,2016,1.05,1.26,5700,Petrol,Individual,Manual,0,2025,9
122,Royal Enfield Bullet 350,2016,1.05,1.17,6000,Petrol,Individual,Manual,0,2025,9
126,Bajaj Avenger 220,2017,0.90,0.95,1300,Petrol,Individual,Manual,0,2025,8
128,Honda CB Hornet 160R,2017,0.80,0.87,3000,Petrol,Individual,Manual,0,2025,8
129,Yamaha FZ S V 2.0,2017,0.78,0.84,5000,Petrol,Individual,Manual,0,2025,8
132,Bajaj Avenger 220,2017,0.75,0.95,3500,Petrol,Individual,Manual,0,2025,8
133,Bajaj Avenger 220,2016,0.72,0.95,500,Petrol,Individual,Manual,0,2025,9
135,Bajaj Pulsar 150,2015,0.65,0.74,5000,Petrol,Individual,Manual,0,2025,10
155,Honda Activa 4G,2017,0.48,0.51,4300,Petrol,Individual,Automatic,0,2025,8
159,Honda Activa 4G,2017,0.45,0.51,4000,Petrol,Individual,Automatic,0,2025,8
165,Activa 3g,2016,0.45,0.54,500,Petrol,Individual,Automatic,0,2025,9
166,Hero Passion Pro,2016,0.45,0.55,1000,Petrol,Individual,Manual,0,2025,9
171,Hero Passion Pro,2015,0.40,0.55,6700,Petrol,Individual,Manual,0,2025,10
173,Activa 4g,2017,0.40,0.51,1300,Petrol,Individual,Automatic,0,2025,8
205,grand i10,2016,5.25,5.70,3493,Petrol,Dealer,Manual,1,2025,9
208,i20,2017,7.90,8.10,3435,Petrol,Dealer,Manual,0,2025,8
234,grand i10,2015,5.50,5.70,4492,Petrol,Dealer,Manual,0,2025,10
261,brio,2016,5.50,5.97,5600,Petrol,Dealer,Manual,0,2025,9
278,jazz,2016,6.00,8.40,4000,Petrol,Dealer,Manual,0,2025,9
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,2025,9

In [42]:
df2=pd.read_csv(r"D:\sujal class\files\daily_total_births.csv")

In [43]:
df2

           Date  Births
0    1959-01-01      35
1    1959-01-02      32
2    1959-01-03      30
3    1959-01-04      31
4    1959-01-05      44
..          ...     ...
360  1959-12-27      37
361  1959-12-28      52
362  1959-12-29      48
363  1959-12-30      55
364  1959-12-31      50

[365 rows x 2 columns]

In [44]:
df2.head()

         Date  Births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [45]:
df2.shape

(365, 2)

In [46]:
df2.isnull().sum()

Date      0
Births    0
dtype: int64

In [47]:
df2.describe()

           Births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000

In [48]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    365 non-null    object
 1   Births  365 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.8+ KB

In [49]:
date = pd.to_datetime(df2['Date'])

In [50]:
date

0     1959-01-01
1     1959-01-02
2     1959-01-03
3     1959-01-04
4     1959-01-05
         ...
360   1959-12-27
361   1959-12-28
362   1959-12-29
363   1959-12-30
364   1959-12-31
Name: Date, Length: 365, dtype: datetime64[ns]

In [51]:
# To add new column in the table

df2['converted_date']=pd.to_datetime(df2['Date'])

In [52]:
df2

           Date  Births converted_date
0    1959-01-01      35     1959-01-01
1    1959-01-02      32     1959-01-02
2    1959-01-03      30     1959-01-03
3    1959-01-04      31     1959-01-04
4    1959-01-05      44     1959-01-05
..          ...     ...            ...
360  1959-12-27      37     1959-12-27
361  1959-12-28      52     1959-12-28
362  1959-12-29      48     1959-12-29
363  1959-12-30      55     1959-12-30
364  1959-12-31      50     1959-12-31

[365 rows x 3 columns]

In [53]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            365 non-null    object
 1   Births          365 non-null    int64
 2   converted_date  365 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.7+ KB

In [54]:
# To acces the year
df2['Year']=df2['converted_date'].dt.year

In [55]:
df2.head()

         Date  Births converted_date  Year
0  1959-01-01      35     1959-01-01  1959
1  1959-01-02      32     1959-01-02  1959
2  1959-01-03      30     1959-01-03  1959
3  1959-01-04      31     1959-01-04  1959
4  1959-01-05      44     1959-01-05  1959

In [56]:
df2.tail()

           Date  Births converted_date  Year
360  1959-12-27      37     1959-12-27  1959
361  1959-12-28      52     1959-12-28  1959
362  1959-12-29      48     1959-12-29  1959
363  1959-12-30      55     1959-12-30  1959
364  1959-12-31      50     1959-12-31  1959

In [57]:
df2['Month']=df2['converted_date'].dt.month

In [58]:
df2

           Date  Births converted_date  Year  Month
0    1959-01-01      35     1959-01-01  1959      1
1    1959-01-02      32     1959-01-02  1959      1
2    1959-01-03      30     1959-01-03  1959      1
3    1959-01-04      31     1959-01-04  1959      1
4    1959-01-05      44     1959-01-05  1959      1
..          ...     ...            ...   ...    ...
360  1959-12-27      37     1959-12-27  1959     12
361  1959-12-28      52     1959-12-28  1959     12
362  1959-12-29      48     1959-12-29  1959     12
363  1959-12-30      55     1959-12-30  1959     12
364  1959-12-31      50     1959-12-31  1959     12

[365 rows x 5 columns]

In [59]:
df2['week']=df2['converted_date'].dt.isocalendar().week

In [60]:
df2

           Date  Births converted_date  Year  Month  week
0    1959-01-01      35     1959-01-01  1959      1     1
1    1959-01-02      32     1959-01-02  1959      1     1
2    1959-01-03      30     1959-01-03  1959      1     1
3    1959-01-04      31     1959-01-04  1959      1     1
4    1959-01-05      44     1959-01-05  1959      1     2
..          ...     ...            ...   ...    ...   ...
360  1959-12-27      37     1959-12-27  1959     12    52
361  1959-12-28      52     1959-12-28  1959     12    53
362  1959-12-29      48     1959-12-29  1959     12    53
363  1959-12-30      55     1959-12-30  1959     12    53
364  1959-12-31      50     1959-12-31  1959     12    53

[365 rows x 6 columns]

In [61]:
df2['Month'].value_counts()

1     31
3     31
5     31
7     31
8     31
10    31
12    31
4     30
6     30
9     30
11    30
2     28
Name: Month, dtype: int64

In [62]:
df2.head()

         Date  Births converted_date  Year  Month  week
0  1959-01-01      35     1959-01-01  1959      1     1
1  1959-01-02      32     1959-01-02  1959      1     1
2  1959-01-03      30     1959-01-03  1959      1     1
3  1959-01-04      31     1959-01-04  1959      1     1
4  1959-01-05      44     1959-01-05  1959      1     2

In [63]:
# Drop = is used for remove column

df2.drop('week',axis=1)

           Date  Births converted_date  Year  Month
0    1959-01-01      35     1959-01-01  1959      1
1    1959-01-02      32     1959-01-02  1959      1
2    1959-01-03      30     1959-01-03  1959      1
3    1959-01-04      31     1959-01-04  1959      1
4    1959-01-05      44     1959-01-05  1959      1
..          ...     ...            ...   ...    ...
360  1959-12-27      37     1959-12-27  1959     12
361  1959-12-28      52     1959-12-28  1959     12
362  1959-12-29      48     1959-12-29  1959     12
363  1959-12-30      55     1959-12-30  1959     12
364  1959-12-31      50     1959-12-31  1959     12

[365 rows x 5 columns]

In [64]:
# inplace save the data in same dataframe

df2.drop('week',axis=1,inplace=True)

In [65]:
df2

           Date  Births converted_date  Year  Month
0    1959-01-01      35     1959-01-01  1959      1
1    1959-01-02      32     1959-01-02  1959      1
2    1959-01-03      30     1959-01-03  1959      1
3    1959-01-04      31     1959-01-04  1959      1
4    1959-01-05      44     1959-01-05  1959      1
..          ...     ...            ...   ...    ...
360  1959-12-27      37     1959-12-27  1959     12
361  1959-12-28      52     1959-12-28  1959     12
362  1959-12-29      48     1959-12-29  1959     12
363  1959-12-30      55     1959-12-30  1959     12
364  1959-12-31      50     1959-12-31  1959     12

[365 rows x 5 columns]

In [66]:
# Remove row wise

df2.drop(1)

           Date  Births converted_date  Year  Month
0    1959-01-01      35     1959-01-01  1959      1
2    1959-01-03      30     1959-01-03  1959      1
3    1959-01-04      31     1959-01-04  1959      1
4    1959-01-05      44     1959-01-05  1959      1
5    1959-01-06      29     1959-01-06  1959      1
..          ...     ...            ...   ...    ...
360  1959-12-27      37     1959-12-27  1959     12
361  1959-12-28      52     1959-12-28  1959     12
362  1959-12-29      48     1959-12-29  1959     12
363  1959-12-30      55     1959-12-30  1959     12
364  1959-12-31      50     1959-12-31  1959     12

[364 rows x 5 columns]

In [67]:
# Loc[] give data index wise

df2.loc[2]

Date                       1959-01-03
Births                             30
converted_date    1959-01-03 00:00:00
Year                             1959
Month                               1
Name: 2, dtype: object

In [68]:
df2.loc[[2,3]]

         Date  Births converted_date  Year  Month
2  1959-01-03      30     1959-01-03  1959      1
3  1959-01-04      31     1959-01-04  1959      1

In [69]:
df2.loc[2:7]

         Date  Births converted_date  Year  Month
2  1959-01-03      30     1959-01-03  1959      1
3  1959-01-04      31     1959-01-04  1959      1
4  1959-01-05      44     1959-01-05  1959      1
5  1959-01-06      29     1959-01-06  1959      1
6  1959-01-07      45     1959-01-07  1959      1
7  1959-01-08      43     1959-01-08  1959      1

In [70]:
df2.loc[2:7:2]

         Date  Births converted_date  Year  Month
2  1959-01-03      30     1959-01-03  1959      1
4  1959-01-05      44     1959-01-05  1959      1
6  1959-01-07      45     1959-01-07  1959      1

In [71]:
df2.loc[2:7,['Date','Births','converted_date']]

         Date  Births converted_date
2  1959-01-03      30     1959-01-03
3  1959-01-04      31     1959-01-04
4  1959-01-05      44     1959-01-05
5  1959-01-06      29     1959-01-06
6  1959-01-07      45     1959-01-07
7  1959-01-08      43     1959-01-08

In [72]:
# iloc 

df2.iloc[2:7, 0:3]

         Date  Births converted_date
2  1959-01-03      30     1959-01-03
3  1959-01-04      31     1959-01-04
4  1959-01-05      44     1959-01-05
5  1959-01-06      29     1959-01-06
6  1959-01-07      45     1959-01-07

In [73]:
df.dropna()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
6,7,"McCarthy, Mr. Timothy J",1,male,54.0,0,0,17463,51.8625,E46,S,0
10,11,"Sandstrom, Miss. Marguerite Rut",3,female,4.0,1,1,PP 9549,16.7000,G6,S,1
11,12,"Bonnell, Miss. Elizabeth",1,female,58.0,0,0,113783,26.5500,C103,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",1,female,47.0,1,1,11751,52.5542,D35,S,1
872,873,"Carlsson, Mr. Frans Olof",1,male,33.0,0,0,695,5.0000,B51 B53 B55,S,0
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",1,female,56.0,0,1,11767,83.1583,C50,C,1
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1

In [74]:
df.dropna(thresh=3)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [75]:
df.isnull().sum()

PassengerId      0
Name             0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [76]:
# fillna mean add value on the place of null value

df.fillna(4)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,4,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,4,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,4,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,4,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,4.0,1,2,W./C. 6607,23.4500,4,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,4,Q,0

In [77]:
df.fillna(value=df['Age'].mean())

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.000000,1,0,A/5 21171,7.2500,29.699118,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.000000,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.000000,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.000000,0,0,373450,8.0500,29.699118,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.000000,0,0,211536,13.0000,29.699118,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.000000,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,29.699118,1,2,W./C. 6607,23.4500,29.699118,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.000000,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.000000,0,0,370376,7.7500,29.699118,Q,0

In [78]:
data={
    'name':['abc','def','ghi','hij'],
    'salary':[100,200,300,400],
    'mail_id':['abc@gmail.com','def@gmail.com','ghi@gmail.com','hij@gmail.com'],
    'addr':['mum','pune','delhi','mum']
}

In [79]:
df=pd.DataFrame(data)

In [80]:
df

  name  salary        mail_id   addr
0  abc     100  abc@gmail.com    mum
1  def     200  def@gmail.com   pune
2  ghi     300  ghi@gmail.com  delhi
3  hij     400  hij@gmail.com    mum

In [81]:
pd.DataFrame(data )

  name  salary        mail_id   addr
0  abc     100  abc@gmail.com    mum
1  def     200  def@gmail.com   pune
2  ghi     300  ghi@gmail.com  delhi
3  hij     400  hij@gmail.com    mum

In [82]:
data1={
    'pf_num' : [234,456,234,567],
    'income_tax' : [4545,655,342,3234],
    'mobile_num' : [23243,123342,34534,23423],
    'course' : ['DS','DA','PFS','FS']
}

In [83]:
df1=pd.DataFrame(data1)

In [84]:
df1

   pf_num  income_tax  mobile_num course
0     234        4545       23243     DS
1     456         655      123342     DA
2     234         342       34534    PFS
3     567        3234       23423     FS

In [85]:
# concat

pd.concat([df,df1],axis=1)

  name  salary        mail_id   addr  pf_num  income_tax  mobile_num course
0  abc     100  abc@gmail.com    mum     234        4545       23243     DS
1  def     200  def@gmail.com   pune     456         655      123342     DA
2  ghi     300  ghi@gmail.com  delhi     234         342       34534    PFS
3  hij     400  hij@gmail.com    mum     567        3234       23423     FS

In [86]:
data2={
    '0' : ['abc','bcd','efg','hij'],
    '1' : [100,200,300,400],
    '2' : ['abc@gmail.com','def@gmail.com','ghi@gmail.com','hij@gmail.com'],
    '3' : ['Mumbai','Pune','Mumbai','Banglore']
}

data3 = {
    '0' : [234,45,54465,656],
    '1' : [234,565,300,400],
    '2' : [23453,45678,45546,434546],
    '3' : ['ds','bigdata','python','web']
}

In [87]:
df2=pd.DataFrame(data2)
df3=pd.DataFrame(data3,index=[4,5,6,7])

In [88]:
df2

     0    1              2         3
0  abc  100  abc@gmail.com    Mumbai
1  bcd  200  def@gmail.com      Pune
2  efg  300  ghi@gmail.com    Mumbai
3  hij  400  hij@gmail.com  Banglore

In [89]:
df3

       0    1       2        3
4    234  234   23453       ds
5     45  565   45678  bigdata
6  54465  300   45546   python
7    656  400  434546      web

In [90]:
pd.concat([df2,df3])

       0    1              2         3
0    abc  100  abc@gmail.com    Mumbai
1    bcd  200  def@gmail.com      Pune
2    efg  300  ghi@gmail.com    Mumbai
3    hij  400  hij@gmail.com  Banglore
4    234  234          23453        ds
5     45  565          45678   bigdata
6  54465  300          45546    python
7    656  400         434546       web

In [91]:
data4={
    'emp_id' : [101,102,103,104],
    'salary' : [234,345,200,400],
    'pf' : [23,34,56,78]
}

data5={
    'emp_id' : [101,102,103,104],
    'mobile_no' : [3434,5656,767,678],
    'house_no' : [345,345,345,345]
}

In [92]:
df4=pd.DataFrame(data4)
df5=pd.DataFrame(data5)

In [93]:
df4

   emp_id  salary  pf
0     101     234  23
1     102     345  34
2     103     200  56
3     104     400  78

In [94]:
df5

   emp_id  mobile_no  house_no
0     101       3434       345
1     102       5656       345
2     103        767       345
3     104        678       345

In [95]:
#  Merge

pd.merge(df4,df5)

   emp_id  salary  pf  mobile_no  house_no
0     101     234  23       3434       345
1     102     345  34       5656       345
2     103     200  56        767       345
3     104     400  78        678       345

In [96]:
pd.merge(df4,df5,how='left')

   emp_id  salary  pf  mobile_no  house_no
0     101     234  23       3434       345
1     102     345  34       5656       345
2     103     200  56        767       345
3     104     400  78        678       345

In [97]:
pd.merge(df4,df5 , how = 'left' , on = 'emp_id')

   emp_id  salary  pf  mobile_no  house_no
0     101     234  23       3434       345
1     102     345  34       5656       345
2     103     200  56        767       345
3     104     400  78        678       345

In [98]:
data6={
    'emp_id1' : [101,102,103,104],
    'salary1' : [234,345,200,400],
    'pf1' : [23,34,56,78]
}

data7={
    'emp_id2' : [101,102,103,104],
    'mobile_no2' : [3434,5656,767,678],
    'house_no2' : [345,345,345,345]
}

In [99]:
df6=pd.DataFrame(data6)
df7=pd.DataFrame(data7)

In [100]:
df6

   emp_id1  salary1  pf1
0      101      234   23
1      102      345   34
2      103      200   56
3      104      400   78

In [101]:
df7

   emp_id2  mobile_no2  house_no2
0      101        3434        345
1      102        5656        345
2      103         767        345
3      104         678        345

In [102]:
pd.merge(df6,df7, left_on='emp_id1',right_on='emp_id2')

   emp_id1  salary1  pf1  emp_id2  mobile_no2  house_no2
0      101      234   23      101        3434        345
1      102      345   34      102        5656        345
2      103      200   56      103         767        345
3      104      400   78      104         678        345

In [103]:
data8={
    'emp_id' : [101,102,103,104],
    'salary' : [234,345,200,400],
    'pf' : [23,34,56,78]
}

data9={
    'emp_id' : [101,102,104,105,123],
    'mobile_no' : [3434,5656,767,678,454],
    'house_no' : [345,345,345,345,4534]
}

In [104]:
df8=pd.DataFrame(data8)
df9=pd.DataFrame(data9)

In [105]:
df8

   emp_id  salary  pf
0     101     234  23
1     102     345  34
2     103     200  56
3     104     400  78

In [106]:
df9

   emp_id  mobile_no  house_no
0     101       3434       345
1     102       5656       345
2     104        767       345
3     105        678       345
4     123        454      4534

In [107]:
pd.merge(df8,df9)

   emp_id  salary  pf  mobile_no  house_no
0     101     234  23       3434       345
1     102     345  34       5656       345
2     104     400  78        767       345

In [108]:
data10={
    'emp_id1' : [101,102,103,104],
    'salary1' : [234,345,200,400],
    'pf1' : [23,34,56,78]
}

data11={
    'emp_id2' : [101,102,104,105,123],
    'mobile_no2' : [3434,5656,767,678,454],
    'house_no2' : [345,345,345,345,4534]
}

In [109]:
df10=pd.DataFrame(data10 , index=['a','b','c','d'])
df11=pd.DataFrame(data11 , index=['a','b','d','e','f'])

In [110]:
df10

   emp_id1  salary1  pf1
a      101      234   23
b      102      345   34
c      103      200   56
d      104      400   78

In [111]:
df11

   emp_id2  mobile_no2  house_no2
a      101        3434        345
b      102        5656        345
d      104         767        345
e      105         678        345
f      123         454       4534

In [112]:
df10.join(df11)

   emp_id1  salary1  pf1  emp_id2  mobile_no2  house_no2
a      101      234   23    101.0      3434.0      345.0
b      102      345   34    102.0      5656.0      345.0
c      103      200   56      NaN         NaN        NaN
d      104      400   78    104.0       767.0      345.0

In [113]:
df11.join(df10)

   emp_id2  mobile_no2  house_no2  emp_id1  salary1   pf1
a      101        3434        345    101.0    234.0  23.0
b      102        5656        345    102.0    345.0  34.0
d      104         767        345    104.0    400.0  78.0
e      105         678        345      NaN      NaN   NaN
f      123         454       4534      NaN      NaN   NaN

In [114]:
df=pd.read_csv(r"D:\sujal class\files\car_data.csv")

In [115]:
df

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [116]:
# If present price is greater than 5 print high less than 5 print low

def review(x):
    if x>5:
        return("high")
    else:
        return("low")

In [117]:
df['Review']=df['Present_Price'].apply(review)

In [118]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Review
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,high
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,high
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,high
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,low
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,high

In [119]:
#  To check the length of car name column

df['Car_length']=df['Car_Name'].apply(len)

In [120]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Review,Car_length
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,high,4
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,high,3
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,high,4
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,low,7
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,high,5

In [121]:
df=pd.read_excel(r"D:\sujal class\files\Titanic.xlsx")

In [122]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [123]:
# To check category

pd.Categorical(df)

['PassengerId', 'Name', 'Pclass', 'Sex', 'Age', ..., 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived']
Length: 12
Categories (12, object): ['Age', 'Cabin', 'Embarked', 'Fare', ..., 'Sex', 'SibSp', 'Survived', 'Ticket']

In [124]:
# To check the category in specific column

pd.Categorical(df['Embarked'])

['S', 'C', 'S', 'S', 'S', ..., 'S', 'S', 'S', 'C', 'Q']
Length: 891
Categories (3, object): ['C', 'Q', 'S']

In [125]:
pd.Categorical(df['Sex'])

['male', 'female', 'female', 'female', 'male', ..., 'male', 'female', 'female', 'male', 'male']
Length: 891
Categories (2, object): ['female', 'male']

In [126]:
pd.Categorical(df['Pclass'])

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [127]:
# To check unique value from table 

df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [128]:
df['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [129]:
a= ["abc" , "der" , "hello" , "good"]

In [130]:
df1=pd.Series(a)

In [131]:
df1

0      abc
1      der
2    hello
3     good
dtype: object

In [132]:
df=pd.read_csv(r"D:\sujal class\files\car_data.csv")

In [133]:
df.duplicated().sum()

2

In [134]:
# check the duplacated value with the row
df[df.duplicated()==True]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
17,ertiga,2016,7.75,10.79,43000,Diesel,Dealer,Manual,0
93,fortuner,2015,23.00,30.61,40000,Diesel,Dealer,Automatic,0

In [135]:
#  to delate duplacate values

df.drop_duplicates()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [136]:
# To change value in the column

df['Year'].replace(2014,2025,inplace=True)

In [137]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2025,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2025,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [138]:
#  convert data frame into array

array = df.to_numpy()

In [139]:
array

array([['ritz', 2025, 3.35, ..., 'Dealer', 'Manual', 0],
       ['sx4', 2013, 4.75, ..., 'Dealer', 'Manual', 0],
       ['ciaz', 2017, 7.25, ..., 'Dealer', 'Manual', 0],
       ...,
       ['city', 2009, 3.35, ..., 'Dealer', 'Manual', 0],
       ['city', 2017, 11.5, ..., 'Dealer', 'Manual', 0],
       ['brio', 2016, 5.3, ..., 'Dealer', 'Manual', 0]], dtype=object)

In [140]:
type(array)

numpy.ndarray

In [141]:
array.ndim

2

In [142]:
pd.DataFrame(array)

           0     1     2     3      4       5       6       7  8
0       ritz  2025  3.35  5.59  27000  Petrol  Dealer  Manual  0
1        sx4  2013  4.75  9.54  43000  Diesel  Dealer  Manual  0
2       ciaz  2017  7.25  9.85   6900  Petrol  Dealer  Manual  0
3    wagon r  2011  2.85  4.15   5200  Petrol  Dealer  Manual  0
4      swift  2025   4.6  6.87  42450  Diesel  Dealer  Manual  0
..       ...   ...   ...   ...    ...     ...     ...     ... ..
296     city  2016   9.5  11.6  33988  Diesel  Dealer  Manual  0
297     brio  2015   4.0   5.9  60000  Petrol  Dealer  Manual  0
298     city  2009  3.35  11.0  87934  Petrol  Dealer  Manual  0
299     city  2017  11.5  12.5   9000  Diesel  Dealer  Manual  0
300     brio  2016   5.3   5.9   5464  Petrol  Dealer  Manual  0

[301 rows x 9 columns]

In [143]:
df3=pd.read_csv(r"D:\sujal class\files\admission_data.csv")

In [144]:
df3.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
0,337,118,4,4.5,4.5,9.65,1,0.92
1,324,107,4,4.0,4.5,8.87,1,0.76
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65

In [145]:
df3.tail()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
495,332,108,5,4.5,4.0,9.02,1,0.87
496,337,117,5,5.0,5.0,9.87,1,0.96
497,330,120,5,4.5,5.0,9.56,1,0.93
498,312,103,4,4.0,5.0,8.43,0,0.73
499,327,113,4,4.5,4.5,9.04,0,0.84

In [146]:
type(df3)

pandas.core.frame.DataFrame

In [147]:
df3.shape

(500, 8)

In [148]:
df3.describe()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
count,500.000000,500.000000,500.000000,500.000000,500.00000,500.000000,500.000000,500.00000
mean,316.472000,107.192000,3.114000,3.374000,3.48400,8.576440,0.560000,0.72174
std,11.295148,6.081868,1.143512,0.991004,0.92545,0.604813,0.496884,0.14114
min,290.000000,92.000000,1.000000,1.000000,1.00000,6.800000,0.000000,0.34000
25%,308.000000,103.000000,2.000000,2.500000,3.00000,8.127500,0.000000,0.63000
50%,317.000000,107.000000,3.000000,3.500000,3.50000,8.560000,1.000000,0.72000
75%,325.000000,112.000000,4.000000,4.000000,4.00000,9.040000,1.000000,0.82000
max,340.000000,120.000000,5.000000,5.000000,5.00000,9.920000,1.000000,0.97000

In [149]:
df3[1:7]

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
1,324,107,4,4.0,4.5,8.87,1,0.76
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
5,330,115,5,4.5,3.0,9.34,1,0.90
6,321,109,3,3.0,4.0,8.20,1,0.75

In [150]:
df3[1:7:2]

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
1,324,107,4,4.0,4.5,8.87,1,0.76
3,322,110,3,3.5,2.5,8.67,1,0.80
5,330,115,5,4.5,3.0,9.34,1,0.90

In [151]:
df3['GRE Score'][1:8]

1    324
2    316
3    322
4    314
5    330
6    321
7    308
Name: GRE Score, dtype: int64

In [152]:
df3.drop(1)

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
0,337,118,4,4.5,4.5,9.65,1,0.92
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
5,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...
495,332,108,5,4.5,4.0,9.02,1,0.87
496,337,117,5,5.0,5.0,9.87,1,0.96
497,330,120,5,4.5,5.0,9.56,1,0.93
498,312,103,4,4.0,5.0,8.43,0,0.73
499,327,113,4,4.5,4.5,9.04,0,0.84

In [153]:
type(df3)

pandas.core.frame.DataFrame

In [154]:
df3 = 1

In [155]:
df3 = df1 + df2

In [156]:
df3 = pd.DataFrame({...})

In [157]:
df3

          0
0  Ellipsis

In [158]:
df3.drop(1)

KeyError: '[1] not found in axis'

In [ ]:
df3.drop(1, inplace=True)